
/*A.3.5 Multipart Messages
While the system is running, the controller may request state from the datapath using the
OFPT_MULTIPART_REQUEST message:*/
struct ofp_multipart_request {
    struct ofp_header header;
    uint16_t type; /* One of the OFPMP_* constants. */
    uint16_t flags; /* OFPMPF_REQ_* flags. */
    uint8_t pad[4];
    uint8_t body[0]; /* Body of the request. */
};
OFP_ASSERT(sizeof(struct ofp_multipart_request) == 16);

enum ofp_multipart_request_flags {
    OFPMPF_REQ_MORE = 1 << 0 /* More requests to follow. */
};
/*The switch responds with one or more OFPT_MULTIPART_REPLY messages:*/
struct ofp_multipart_reply {
    struct ofp_header header;
    uint16_t type; /* One of the OFPMP_* constants. */
    uint16_t flags; /* OFPMPF_REPLY_* flags. */
    uint8_t pad[4];
    uint8_t body[0]; /* Body of the reply. */
};
OFP_ASSERT(sizeof(struct ofp_multipart_reply) == 16);

enum ofp_multipart_reply_flags {
    OFPMPF_REPLY_MORE = 1 << 0 /* More replies to follow. */
};

/*The only value dened for flags in a request and reply is whether more requests/replies will follow
this one - this has the value 0x0001. To ease implementation, the controller is allowed to send requests
and the switch is allowed to send replies with no additional entries. However, another message must
always follow a message with the more 
ag set. A request that spans multiple messages (has one
or more messages with the more 
ag set), must use the same transaction id (xid) for all messages
in the request. Messages from a multipart request may be interleaved with other OpenFlow message
types, including other multipart requests, but must have distinct transaction ids if multiple unanswered
multipart requests are in 
ight simultaneously. If a request spans multiple messages and grows to a
size that the switch is unable to buer, the switch should respond with an error messsage of type
OFPET_BAD_REQUEST and code OFPBRC_MULTIPART_BUFFER_OVERFLOW. Transaction ids of replies must
always match the request that prompted them.
In both the request and response, the type eld species the kind of information being passed and
determines how the body eld is interpreted:*/
enum ofp_multipart_types {
    /* Description of this OpenFlow switch.
    * The request body is empty.
    * The reply body is struct ofp_desc. */
    OFPMP_DESC = 0,
    /* Individual flow statistics.
    * The request body is struct ofp_flow_stats_request.
    * The reply body is an array of struct ofp_flow_stats. */
    OFPMP_FLOW = 1,
    /* Aggregate flow statistics.
    * The request body is struct ofp_aggregate_stats_request.
    * The reply body is struct ofp_aggregate_stats_reply. */
    OFPMP_AGGREGATE = 2,
    /* Flow table statistics.
    * The request body is empty.
    * The reply body is an array of struct ofp_table_stats. */
    OFPMP_TABLE = 3,
    /* Port statistics.
    * The request body is struct ofp_port_stats_request.
    * The reply body is an array of struct ofp_port_stats. */
    OFPMP_PORT_STATS = 4,
    /* Queue statistics for a port
    * The request body is struct ofp_queue_stats_request.
    * The reply body is an array of struct ofp_queue_stats */
    OFPMP_QUEUE = 5,
    /* Group counter statistics.
    * The request body is struct ofp_group_stats_request.
    * The reply is an array of struct ofp_group_stats. */
    OFPMP_GROUP = 6,
    /* Group description.
    * The request body is empty.
    * The reply body is an array of struct ofp_group_desc_stats. */
    OFPMP_GROUP_DESC = 7,
    /* Group features.
    * The request body is empty.
    * The reply body is struct ofp_group_features. */
    OFPMP_GROUP_FEATURES = 8,
    /* Meter statistics.
    * The request body is struct ofp_meter_multipart_requests.
    * The reply body is an array of struct ofp_meter_stats. */
    OFPMP_METER = 9,
    /* Meter configuration.
    * The request body is struct ofp_meter_multipart_requests.
    * The reply body is an array of struct ofp_meter_config. */
    OFPMP_METER_CONFIG = 10,
    /* Meter features.
    73 . 2012; The Open Networking Foundation
    OpenFlow Switch Specication Version 1.3.1
    * The request body is empty.
    * The reply body is struct ofp_meter_features. */
    OFPMP_METER_FEATURES = 11,
    /* Table features.
    * The request body is either empty or contains an array of
    * struct ofp_table_features containing the controller's
    * desired view of the switch. If the switch is unable to
    * set the specified view an error is returned.
    * The reply body is an array of struct ofp_table_features. */
    OFPMP_TABLE_FEATURES = 12,
    /* Port description.
    * The request body is empty.
    * The reply body is an array of struct ofp_port. */
    OFPMP_PORT_DESC = 13,
    /* Experimenter extension.
    * The request and reply bodies begin with
    * struct ofp_experimenter_multipart_header.
    * The request and reply bodies are otherwise experimenter-defined. */
    OFPMP_EXPERIMENTER = 0xffff
};
/*In all types of multipart reply containing statistics, if a specic numeric counter is not available in the
switch, its value must be set to the maximum eld value (the unsigned equivalent of -1). Counters are
unsigned and wrap around with no over
ow indicator.*/

/*A.3.5.1 Description
Information about the switch manufacturer, hardware revision, software revision, serial number, and a
description eld is available from the OFPMP_DESC multipart request type:*/
/* Body of reply to OFPMP_DESC request. Each entry is a NULL-terminated
* ASCII string. */
struct ofp_desc {
    char mfr_desc[DESC_STR_LEN]; /* Manufacturer description. */
    char hw_desc[DESC_STR_LEN]; /* Hardware description. */
    char sw_desc[DESC_STR_LEN]; /* Software description. */
    char serial_num[SERIAL_NUM_LEN]; /* Serial number. */
    char dp_desc[DESC_STR_LEN]; /* Human readable description of datapath. */
};
OFP_ASSERT(sizeof(struct ofp_desc) == 1056);
/*Each entry is ASCII formatted and padded on the right with null bytes (n0). DESC_STR_LEN is 256 and
SERIAL_NUM_LEN is 32. The dp_desc eld is a free-form string to describe the datapath for debugging
purposes, e.g., \switch3 in room 3120". As such, it is not guaranteed to be unique and should not be
used as the primary identier for the datapath|use the datapath_id eld from the switch features
instead (see A.3.1).*/

A.3.5.2 Individual Flow Statistics
Information about individual 
ow entries is requested with the OFPMP_FLOW multipart request type:
/* Body for ofp_multipart_request of type OFPMP_FLOW. */
struct ofp_flow_stats_request {
uint8_t table_id; /* ID of table to read (from ofp_table_stats),
OFPTT_ALL for all tables. */
uint8_t pad[3]; /* Align to 32 bits. */
uint32_t out_port; /* Require matching entries to include this
as an output port. A value of OFPP_ANY
indicates no restriction. */
uint32_t out_group; /* Require matching entries to include this
as an output group. A value of OFPG_ANY
indicates no restriction. */
uint8_t pad2[4]; /* Align to 64 bits. */
uint64_t cookie; /* Require matching entries to contain this
cookie value */
uint64_t cookie_mask; /* Mask used to restrict the cookie bits that
must match. A value of 0 indicates
no restriction. */
struct ofp_match match; /* Fields to match. Variable size. */
};
OFP_ASSERT(sizeof(struct ofp_flow_stats_request) == 40);
The match eld contains a description of the 
ow entries that should be matched and may contain
wildcarded and masked elds. This eld's matching behavior is described in Section 6.4.
The table_id eld indicates the index of a single table to read, or OFPTT_ALL for all tables.
The out_port and out_group elds optionally lter by output port and group. If either out_port or
out_group contain a value other than OFPP_ANY and OFPG_ANY respectively, it introduces a constraint
when matching. This constraint is that the 
ow entry must contain an output action directed at that
port or group. Other constraints such as ofp_match structs are still used; this is purely an additional
constraint. Note that to disable output ltering, both out_port and out_group must be set to OFPP_ANY
and OFPG_ANY respectively.
The usage of the cookie and cookie_mask elds is dened in Section 6.4.
The body of the reply to a OFPMP_FLOW multipart request consists of an array of the following:
/* Body of reply to OFPMP_FLOW request. */
struct ofp_flow_stats {
uint16_t length; /* Length of this entry. */
uint8_t table_id; /* ID of table flow came from. */
uint8_t pad;
uint32_t duration_sec; /* Time flow has been alive in seconds. */
uint32_t duration_nsec; /* Time flow has been alive in nanoseconds beyond
duration_sec. */
uint16_t priority; /* Priority of the entry. */
uint16_t idle_timeout; /* Number of seconds idle before expiration. */
uint16_t hard_timeout; /* Number of seconds before expiration. */
uint16_t flags; /* One of OFPFF_*. */
uint8_t pad2[4]; /* Align to 64-bits. */
75 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
uint64_t cookie; /* Opaque controller-issued identifier. */
uint64_t packet_count; /* Number of packets in flow. */
uint64_t byte_count; /* Number of bytes in flow. */
struct ofp_match match; /* Description of fields. Variable size. */
//struct ofp_instruction instructions[0]; /* Instruction set. */
};
OFP_ASSERT(sizeof(struct ofp_flow_stats) == 56);
The elds consist of those provided in the flow_mod that created the 
ow entry (see A.3.4.1), plus
the table_id into which the entry was inserted, the packet_count, and the byte_count counting all
packets processed by the 
ow entry.
The duration_sec and duration_nsec elds indicate the elapsed time the 
ow entry has been installed
in the switch. The total duration in nanoseconds can be computed as duration sec109+duration nsec.
Implementations are required to provide second precision; higher precision is encouraged where available.
A.3.5.3 Aggregate Flow Statistics
Aggregate information about multiple 
ow entries is requested with the OFPMP_AGGREGATE multipart
request type:
/* Body for ofp_multipart_request of type OFPMP_AGGREGATE. */
struct ofp_aggregate_stats_request {
uint8_t table_id; /* ID of table to read (from ofp_table_stats)
OFPTT_ALL for all tables. */
uint8_t pad[3]; /* Align to 32 bits. */
uint32_t out_port; /* Require matching entries to include this
as an output port. A value of OFPP_ANY
indicates no restriction. */
uint32_t out_group; /* Require matching entries to include this
as an output group. A value of OFPG_ANY
indicates no restriction. */
uint8_t pad2[4]; /* Align to 64 bits. */
uint64_t cookie; /* Require matching entries to contain this
cookie value */
uint64_t cookie_mask; /* Mask used to restrict the cookie bits that
must match. A value of 0 indicates
no restriction. */
struct ofp_match match; /* Fields to match. Variable size. */
};
OFP_ASSERT(sizeof(struct ofp_aggregate_stats_request) == 40);
The elds in this message have the same meanings as in the individual 
ow stats request type
(OFPMP_FLOW).
The body of the reply consists of the following:
/* Body of reply to OFPMP_AGGREGATE request. */
struct ofp_aggregate_stats_reply {
uint64_t packet_count; /* Number of packets in flows. */
76 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
uint64_t byte_count; /* Number of bytes in flows. */
uint32_t flow_count; /* Number of flows. */
uint8_t pad[4]; /* Align to 64 bits. */
};
OFP_ASSERT(sizeof(struct ofp_aggregate_stats_reply) == 24);
A.3.5.4 Table Statistics
Information about tables is requested with the OFPMP_TABLE multipart request type. The request does
not contain any data in the body.
The body of the reply consists of an array of the following:
/* Body of reply to OFPMP_TABLE request. */
struct ofp_table_stats {
uint8_t table_id; /* Identifier of table. Lower numbered tables
are consulted first. */
uint8_t pad[3]; /* Align to 32-bits. */
uint32_t active_count; /* Number of active entries. */
uint64_t lookup_count; /* Number of packets looked up in table. */
uint64_t matched_count; /* Number of packets that hit table. */
};
OFP_ASSERT(sizeof(struct ofp_table_stats) == 24);
The array has one structure for each table supported by the switch. The entries are returned in the
order that packets traverse the tables.
A.3.5.5 Table Features
The OFPMP_TABLE_FEATURES multipart type allows a controller to both query for the capabilities of
existing tables, and to optionally ask the switch to recongure its tables to match a supplied conguration.
In general, the table feature capabilities represents all possible features of a table, however some
features may be mutually exclusive and the current capabilities structures do not allow us to represent
such exclusions.
If the OFPMP_TABLE_FEATURES request body is empty the switch will return an array of struct
ofp_table_features containing the capabilities of the currently congured tables. If the request
body contains an array of struct ofp_table_features the switch will attempt to change its tables to
match the requested table conguration. A successful conguration will contain all tables from the
request, and each table's capabilities will either be a superset of, or equal to the requested capabilities.
If the table conguration is successful, 
ows from all tables in the prior conguration are expired, and
expirations sent if requested. The switch then replies with the new conguration, in the same order
as the request where possible. If the switch is unable to set the requested conguration, an error of
type OFPET_TABLE_FEATURES_FAILED is returned, and the current table conguration is returned in the
multipart reply.
The following structure describes the body of the table features request and reply:
77 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
/* Body for ofp_multipart_request of type OFPMP_TABLE_FEATURES./
* Body of reply to OFPMP_TABLE_FEATURES request. */
struct ofp_table_features {
uint16_t length; /* Length is padded to 64 bits. */
uint8_t table_id; /* Identifier of table. Lower numbered tables
are consulted first. */
uint8_t pad[5]; /* Align to 64-bits. */
char name[OFP_MAX_TABLE_NAME_LEN];
uint64_t metadata_match; /* Bits of metadata table can match. */
uint64_t metadata_write; /* Bits of metadata table can write. */
uint32_t config; /* Bitmap of OFPTC_* values */
uint32_t max_entries; /* Max number of entries supported. */
/* Table Feature Property list */
struct ofp_table_feature_prop_header properties[0];
};
OFP_ASSERT(sizeof(struct ofp_table_features) == 64);
The array has one structure for each table supported by the switch. The entries are returned in the
order that packets traverse the tables. OFP_MAX_TABLE_NAME_LEN is 32 .
The metadata_match eld indicates the bits of the metadata eld that the table can match on, when
using the metadata eld of struct ofp_match. A value of 0xFFFFFFFFFFFFFFFF indicates that the
table can match the full metadata eld.
The metadata_write eld indicates the bits of the metadata eld that the table can write using the
OFPIT_WRITE_METADATA instruction. A value of 0xFFFFFFFFFFFFFFFF indicates that the table can write
the full metadata eld.
The config eld is the table conguration that was set on the table via a table conguration message
(see A.3.3).
The max_entries eld describes the maximum number of 
ow entries that can be inserted into that
table. Due to limitations imposed by modern hardware, the max_entries value should be considered
advisory and a best eort approximation of the capacity of the table. Despite the high-level abstraction
of a table, in practice the resource consumed by a single 
ow table entry is not constant. For example,
a 
ow table entry might consume more than one entry, depending on its match parameters (e.g.,
IPv4 vs. IPv6). Also, tables that appear distinct at an OpenFlow-level might in fact share the same
underlying physical resources. Further, on OpenFlow hybrid switches, those table may be shared with
non-OpenFlow functions. The result is that switch implementers should report an approximation of
the total 
ow entries supported and controller writers should not treat this value as a xed, physical
constant.
The properties eld is a list of table feature properties, describing various capabilities of the table.
The list of table feature property types that are currently dened are:
/* Table Feature property types.
* Low order bit cleared indicates a property for a regular Flow Entry.
* Low order bit set indicates a property for the Table-Miss Flow Entry.
*/
enum ofp_table_feature_prop_type {
OFPTFPT_INSTRUCTIONS = 0, /* Instructions property. */
OFPTFPT_INSTRUCTIONS_MISS = 1, /* Instructions for table-miss. */
78 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
OFPTFPT_NEXT_TABLES = 2, /* Next Table property. */
OFPTFPT_NEXT_TABLES_MISS = 3, /* Next Table for table-miss. */
OFPTFPT_WRITE_ACTIONS = 4, /* Write Actions property. */
OFPTFPT_WRITE_ACTIONS_MISS = 5, /* Write Actions for table-miss. */
OFPTFPT_APPLY_ACTIONS = 6, /* Apply Actions property. */
OFPTFPT_APPLY_ACTIONS_MISS = 7, /* Apply Actions for table-miss. */
OFPTFPT_MATCH = 8, /* Match property. */
OFPTFPT_WILDCARDS = 10, /* Wildcards property. */
OFPTFPT_WRITE_SETFIELD = 12, /* Write Set-Field property. */
OFPTFPT_WRITE_SETFIELD_MISS = 13, /* Write Set-Field for table-miss. */
OFPTFPT_APPLY_SETFIELD = 14, /* Apply Set-Field property. */
OFPTFPT_APPLY_SETFIELD_MISS = 15, /* Apply Set-Field for table-miss. */
OFPTFPT_EXPERIMENTER = 0xFFFE, /* Experimenter property. */
OFPTFPT_EXPERIMENTER_MISS = 0xFFFF, /* Experimenter for table-miss. */
};
The properties with the _MISS sux describe the capabilities for the table-miss 
ow entry (see 5.4),
whereas other properties describe the capabilities for regular 
ow entry. If a specic property does not
have any capability (for example no Set-Field support), a property with an empty list must be included
in the property list. When a property of the table-miss 
ow entry is the same as the corresponding
property for regular 
ow entries (i.e. both properties have the same list of capabilities), this table-miss
property can be omited from the property list.
A property denition contains the property type, length, and any associated data:
/* Common header for all Table Feature Properties */
struct ofp_table_feature_prop_header {
uint16_t type; /* One of OFPTFPT_*. */
uint16_t length; /* Length in bytes of this property. */
};
OFP_ASSERT(sizeof(struct ofp_table_feature_prop_header) == 4);
The OFPTFPT_INSTRUCTIONS and OFPTFPT_INSTRUCTIONS_MISS properties use the following structure
and elds:
/* Instructions property */
struct ofp_table_feature_prop_instructions {
uint16_t type; /* One of OFPTFPT_INSTRUCTIONS,
OFPTFPT_INSTRUCTIONS_MISS. */
uint16_t length; /* Length in bytes of this property. */
/* Followed by:
* - Exactly (length - 4) bytes containing the instruction ids, then
* - Exactly (length + 7)/8*8 - (length) (between 0 and 7)
* bytes of all-zero bytes */
struct ofp_instruction instruction_ids[0]; /* List of instructions */
};
OFP_ASSERT(sizeof(struct ofp_table_feature_prop_instructions) == 4);
The instruction_ids is the list of instructions supported by this table (see 5.9). The elements of that
list are variable size to enable expressing experimenter instructions, non-experimenter instructions are
4 bytes.
79 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
The OFPTFPT_NEXT_TABLES and OFPTFPT_NEXT_TABLES_MISS properties use the following structure and
elds:
/* Next Tables property */
struct ofp_table_feature_prop_next_tables {
uint16_t type; /* One of OFPTFPT_NEXT_TABLES,
OFPTFPT_NEXT_TABLES_MISS. */
uint16_t length; /* Length in bytes of this property. */
/* Followed by:
* - Exactly (length - 4) bytes containing the table_ids, then
* - Exactly (length + 7)/8*8 - (length) (between 0 and 7)
* bytes of all-zero bytes */
uint8_t next_table_ids[0];
};
OFP_ASSERT(sizeof(struct ofp_table_feature_prop_next_tables) == 4);
The next_table_ids is the array of tables that can be directly reached from the present table using
the OFPIT_GOTO_TABLE instruction (see 5.1).
The OFPTFPT_WRITE_ACTIONS, OFPTFPT_WRITE_ACTIONS_MISS, OFPTFPT_APPLY_ACTIONS and
OFPTFPT_APPLY_ACTIONS_MISS properties use the following structure and elds:
/* Actions property */
struct ofp_table_feature_prop_actions {
uint16_t type; /* One of OFPTFPT_WRITE_ACTIONS,
OFPTFPT_WRITE_ACTIONS_MISS,
OFPTFPT_APPLY_ACTIONS,
OFPTFPT_APPLY_ACTIONS_MISS. */
uint16_t length; /* Length in bytes of this property. */
/* Followed by:
* - Exactly (length - 4) bytes containing the action_ids, then
* - Exactly (length + 7)/8*8 - (length) (between 0 and 7)
* bytes of all-zero bytes */
struct ofp_action_header action_ids[0]; /* List of actions */
};
OFP_ASSERT(sizeof(struct ofp_table_feature_prop_actions) == 4);
The action_ids is the list of actions for the feature (see 5.12). The elements of that list are
variable size to enable expressing experimenter actions, non-experimenter actions are 4 bytes. The
OFPTFPT_WRITE_ACTIONS and OFPTFPT_WRITE_ACTIONS_MISS properties describe actions supported
by the table using the OFPIT_WRITE_ACTIONS instruction, whereas the OFPTFPT_APPLY_ACTIONS
and OFPTFPT_APPLY_ACTIONS_MISS properties describe actions supported by the table using the
OFPIT_APPLY_ACTIONS instruction.
The OFPTFPT_MATCH, OFPTFPT_WILDCARDS, OFPTFPT_WRITE_SETFIELD,
OFPTFPT_WRITE_SETFIELD_MISS, OFPTFPT_APPLY_SETFIELD and OFPTFPT_APPLY_SETFIELD_MISS
properties use the following structure and elds:
/* Match, Wildcard or Set-Field property */
struct ofp_table_feature_prop_oxm {
uint16_t type; /* One of OFPTFPT_MATCH,
OFPTFPT_WILDCARDS,
80 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
OFPTFPT_WRITE_SETFIELD,
OFPTFPT_WRITE_SETFIELD_MISS,
OFPTFPT_APPLY_SETFIELD,
OFPTFPT_APPLY_SETFIELD_MISS. */
uint16_t length; /* Length in bytes of this property. */
/* Followed by:
* - Exactly (length - 4) bytes containing the oxm_ids, then
* - Exactly (length + 7)/8*8 - (length) (between 0 and 7)
* bytes of all-zero bytes */
uint32_t oxm_ids[0]; /* Array of OXM headers */
};
OFP_ASSERT(sizeof(struct ofp_table_feature_prop_oxm) == 4);
The oxm_ids is the list of OXM types for the feature (see A.2.3.2). The elements of that list are 32-bit
OXM headers or 64-bit OXM headers for experimenter OXM elds.
The OFPTFPT_MATCH property indicates the elds for which that particular table supports matching on
(see A.2.3.7). For example, if the table can match the ingress port, an OXM header with the type
OFPXMT_OFB_IN_PORT should be included in the list. If the HASMASK bit is set on the OXM header then
the switch must support masking for the given type. The OFPTFPT_WILDCARDS property indicates the
elds for which that particular table supports wildcarding (omiting). For example, a direct look-up
hash table would have that list empty, while a TCAM or sequentially searched table would have it set
to the same value as the OFPTFPT_MATCH property.
The OFPTFPT_WRITE_SETFIELD and OFPTFPT_WRITE_SETFIELD_MISS properties describe Set-Field
action types supported by the table using the OFPIT_WRITE_ACTIONS instruction, whereas the
OFPTFPT_APPLY_SETFIELD and OFPTFPT_APPLY_SETFIELD_MISS properties describe Set-Field action
types supported by the table using the OFPIT_APPLY_ACTIONS instruction.
All elds in ofp_table_features may be requested to be changed by the controller with the exception
of the max_entries eld, this is read only and returned by the switch.
The OFPTFPT_APPLY_ACTIONS, OFPTFPT_APPLY_ACTIONS_MISS, OFPTFPT_APPLY_SETFIELD, and
OFPTFPT_APPLY_SETFIELD_MISS properties contain actions and elds the table is capable of applying.
For each of these lists, if an element is present it means the table is at least capable of applying the
element in isolation one time. There is currently no way to indicate which elements can be applied
together, in which order, and how many time an element can be applied in a single 
ow entry.
The OFPTFPT_EXPERIMENTER and OFPTFPT_EXPERIMENTER_MISS properties uses the following structure
and elds:
/* Experimenter table feature property */
struct ofp_table_feature_prop_experimenter {
uint16_t type; /* One of OFPTFPT_EXPERIMENTER,
OFPTFPT_EXPERIMENTER_MISS. */
uint16_t length; /* Length in bytes of this property. */
uint32_t experimenter; /* Experimenter ID which takes the same
form as in struct
ofp_experimenter_header. */
uint32_t exp_type; /* Experimenter defined. */
/* Followed by:
* - Exactly (length - 12) bytes containing the experimenter data, then
* - Exactly (length + 7)/8*8 - (length) (between 0 and 7)
81 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
* bytes of all-zero bytes */
uint32_t experimenter_data[0];
};
OFP_ASSERT(sizeof(struct ofp_table_feature_prop_experimenter) == 12);
The experimenter eld is the Experimenter ID, which takes the same form as in struct
ofp_experimenter (see A.5.4).
A.3.5.6 Port Statistics
Information about ports statistics is requested with the OFPMP_PORT_STATS multipart request type:
/* Body for ofp_multipart_request of type OFPMP_PORT. */
struct ofp_port_stats_request {
uint32_t port_no; /* OFPMP_PORT message must request statistics
* either for a single port (specified in
* port_no) or for all ports (if port_no ==
* OFPP_ANY). */
uint8_t pad[4];
};
OFP_ASSERT(sizeof(struct ofp_port_stats_request) == 8);
The port_no eld optionally lters the stats request to the given port. To request all port statistics,
port_no must be set to OFPP_ANY.
The body of the reply consists of an array of the following:
/* Body of reply to OFPMP_PORT request. If a counter is unsupported, set
* the field to all ones. */
struct ofp_port_stats {
uint32_t port_no;
uint8_t pad[4]; /* Align to 64-bits. */
uint64_t rx_packets; /* Number of received packets. */
uint64_t tx_packets; /* Number of transmitted packets. */
uint64_t rx_bytes; /* Number of received bytes. */
uint64_t tx_bytes; /* Number of transmitted bytes. */
uint64_t rx_dropped; /* Number of packets dropped by RX. */
uint64_t tx_dropped; /* Number of packets dropped by TX. */
uint64_t rx_errors; /* Number of receive errors. This is a super-set
of more specific receive errors and should be
greater than or equal to the sum of all
rx_*_err values. */
uint64_t tx_errors; /* Number of transmit errors. This is a super-set
of more specific transmit errors and should be
greater than or equal to the sum of all
tx_*_err values (none currently defined.) */
uint64_t rx_frame_err; /* Number of frame alignment errors. */
uint64_t rx_over_err; /* Number of packets with RX overrun. */
uint64_t rx_crc_err; /* Number of CRC errors. */
uint64_t collisions; /* Number of collisions. */
uint32_t duration_sec; /* Time port has been alive in seconds. */
uint32_t duration_nsec; /* Time port has been alive in nanoseconds beyond
82 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
duration_sec. */
};
OFP_ASSERT(sizeof(struct ofp_port_stats) == 112);
The duration_sec and duration_nsec elds indicate the elapsed time the port has been congured
into the OpenFlow pipeline. The total duration in nanoseconds can be computed as duration sec 
109 + duration nsec. Implementations are required to provide second precision; higher precision is
encouraged where available.
A.3.5.7 Port Description
The port description request OFPMP_PORT_DESCRIPTION enables the controller to get a description of all
the ports in the system that support OpenFlow. The request body is empty. The reply body consists
of an array of the following:
/* Description of a port */
struct ofp_port {
uint32_t port_no;
uint8_t pad[4];
uint8_t hw_addr[OFP_ETH_ALEN];
uint8_t pad2[2]; /* Align to 64 bits. */
char name[OFP_MAX_PORT_NAME_LEN]; /* Null-terminated */
uint32_t config; /* Bitmap of OFPPC_* flags. */
uint32_t state; /* Bitmap of OFPPS_* flags. */
/* Bitmaps of OFPPF_* that describe features. All bits zeroed if
* unsupported or unavailable. */
uint32_t curr; /* Current features. */
uint32_t advertised; /* Features being advertised by the port. */
uint32_t supported; /* Features supported by the port. */
uint32_t peer; /* Features advertised by peer. */
uint32_t curr_speed; /* Current port bitrate in kbps. */
uint32_t max_speed; /* Max port bitrate in kbps */
};
OFP_ASSERT(sizeof(struct ofp_port) == 64);
This structure is described in section A.2.1.
A.3.5.8 Queue Statistics
The OFPMP_QUEUE multipart request message provides queue statistics for one or more ports and one
or more queues. The request body contains a port_no eld identifying the OpenFlow port for which
statistics are requested, or OFPP_ANY to refer to all ports. The queue_id eld identies one of the priority
queues, or OFPQ_ALL to refer to all queues congured at the specied port. OFPQ_ALL is 0x.
83 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
struct ofp_queue_stats_request {
uint32_t port_no; /* All ports if OFPP_ANY. */
uint32_t queue_id; /* All queues if OFPQ_ALL. */
};
OFP_ASSERT(sizeof(struct ofp_queue_stats_request) == 8);
The body of the reply consists of an array of the following structure:
struct ofp_queue_stats {
uint32_t port_no;
uint32_t queue_id; /* Queue i.d */
uint64_t tx_bytes; /* Number of transmitted bytes. */
uint64_t tx_packets; /* Number of transmitted packets. */
uint64_t tx_errors; /* Number of packets dropped due to overrun. */
uint32_t duration_sec; /* Time queue has been alive in seconds. */
uint32_t duration_nsec; /* Time queue has been alive in nanoseconds beyond
duration_sec. */
};
OFP_ASSERT(sizeof(struct ofp_queue_stats) == 40);
The duration_sec and duration_nsec elds indicate the elapsed time the queue has been installed in
the switch. The total duration in nanoseconds can be computed as duration sec109+duration nsec.
Implementations are required to provide second precision; higher precision is encouraged where available.
A.3.5.9 Group Statistics
The OFPMP_GROUP multipart request message provides statistics for one or more groups. The request
body consists of a group_id eld, which can be set to OFPG_ALL to refer to all groups on the switch.
/* Body of OFPMP_GROUP request. */
struct ofp_group_stats_request {
uint32_t group_id; /* All groups if OFPG_ALL. */
uint8_t pad[4]; /* Align to 64 bits. */
};
OFP_ASSERT(sizeof(struct ofp_group_stats_request) == 8);
The body of the reply consists of an array of the following structure:
/* Body of reply to OFPMP_GROUP request. */
struct ofp_group_stats {
uint16_t length; /* Length of this entry. */
uint8_t pad[2]; /* Align to 64 bits. */
uint32_t group_id; /* Group identifier. */
uint32_t ref_count; /* Number of flows or groups that directly forward
to this group. */
uint8_t pad2[4]; /* Align to 64 bits. */
uint64_t packet_count; /* Number of packets processed by group. */
uint64_t byte_count; /* Number of bytes processed by group. */
uint32_t duration_sec; /* Time group has been alive in seconds. */
84 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
uint32_t duration_nsec; /* Time group has been alive in nanoseconds beyond
duration_sec. */
struct ofp_bucket_counter bucket_stats[0];
};
OFP_ASSERT(sizeof(struct ofp_group_stats) == 40);
The elds consist of those provided in the group_mod that created the group, plus the ref_count
counting the number of 
ows referencing directly the group, the packet_count, and the byte_count
counting all packets processed by the group.
The duration_sec and duration_nsec elds indicate the elapsed time the group has been installed in
the switch. The total duration in nanoseconds can be computed as duration sec109+duration nsec.
Implementations are required to provide second precision; higher precision is encouraged where available.
The bucket_stats eld consists of an array of ofp_bucket_counter structs:
/* Used in group stats replies. */
struct ofp_bucket_counter {
uint64_t packet_count; /* Number of packets processed by bucket. */
uint64_t byte_count; /* Number of bytes processed by bucket. */
};
OFP_ASSERT(sizeof(struct ofp_bucket_counter) == 16);
A.3.5.10 Group Description
The OFPMP_GROUP_DESC multipart request message provides a way to list the set of groups on a switch,
along with their corresponding bucket actions. The request body is empty, while the reply body is an
array of the following structure:
/* Body of reply to OFPMP_GROUP_DESC request. */
struct ofp_group_desc_stats {
uint16_t length; /* Length of this entry. */
uint8_t type; /* One of OFPGT_*. */
uint8_t pad; /* Pad to 64 bits. */
uint32_t group_id; /* Group identifier. */
struct ofp_bucket buckets[0];
};
OFP_ASSERT(sizeof(struct ofp_group_desc_stats) == 8);
Fields for group description are the same as those used with the ofp_group_mod struct (see A.3.4.2).
A.3.5.11 Group Features
The OFPMP_GROUP_FEATURES multipart request message provides a way to list the capabilities of groups
on a switch. The request body is empty, while the reply body is the following structure:
85 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
/* Body of reply to OFPMP_GROUP_FEATURES request. Group features. */
struct ofp_group_features {
uint32_t types; /* Bitmap of OFPGT_* values supported. */
uint32_t capabilities; /* Bitmap of OFPGFC_* capability supported. */
uint32_t max_groups[4]; /* Maximum number of groups for each type. */
uint32_t actions[4]; /* Bitmaps of OFPAT_* that are supported. */
};
OFP_ASSERT(sizeof(struct ofp_group_features) == 40);
The max_groups eld is the maximum number of groups for each type of groups. The actions is the
supported actions for each type of groups. The capabilities uses the following 
ags:
/* Group configuration flags */
enum ofp_group_capabilities {
OFPGFC_SELECT_WEIGHT = 1 << 0, /* Support weight for select groups */
OFPGFC_SELECT_LIVENESS = 1 << 1, /* Support liveness for select groups */
OFPGFC_CHAINING = 1 << 2, /* Support chaining groups */
OFPGFC_CHAINING_CHECKS = 1 << 3, /* Check chaining for loops and delete */
};
A.3.5.12 Meter Statistics
The OFPMT_METER stats request message provides statistics for one or more meters. The request body
consists of a meter_id eld, which can be set to OFPM_ALL to refer to all meters on the switch.
/* Body of OFPMP_METER and OFPMP_METER_CONFIG requests. */
struct ofp_meter_multipart_request {
uint32_t meter_id; /* Meter instance, or OFPM_ALL. */
uint8_t pad[4]; /* Align to 64 bits. */
};
OFP_ASSERT(sizeof(struct ofp_meter_multipart_request) == 8);
The body of the reply consists of an array of the following structure:
/* Body of reply to OFPMP_METER request. Meter statistics. */
struct ofp_meter_stats {
uint32_t meter_id; /* Meter instance. */
uint16_t len; /* Length in bytes of this stats. */
uint8_t pad[6];
uint32_t flow_count; /* Number of flows bound to meter. */
uint64_t packet_in_count; /* Number of packets in input. */
uint64_t byte_in_count; /* Number of bytes in input. */
uint32_t duration_sec; /* Time meter has been alive in seconds. */
uint32_t duration_nsec; /* Time meter has been alive in nanoseconds beyond
duration_sec. */
struct ofp_meter_band_stats band_stats[0]; /* The band_stats length is
inferred from the length field. */
};
OFP_ASSERT(sizeof(struct ofp_meter_stats) == 40);
86 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
The packet_in_count, and the byte_in_count count all packets processed by the meter.
The duration_sec and duration_nsec elds indicate the elapsed time the meter has been installed in
the switch. The total duration in nanoseconds can be computed as duration sec109+duration nsec.
Implementations are required to provide second precision; higher precision is encouraged where available.
The band_stats eld consists of an array of ofp_meter_band_stats structs:
/* Statistics for each meter band */
struct ofp_meter_band_stats {
uint64_t packet_band_count; /* Number of packets in band. */
uint64_t byte_band_count; /* Number of bytes in band. */
};
OFP_ASSERT(sizeof(struct ofp_meter_band_stats) == 16);
The packet_band_count, and the byte_band_count count all packets processed by the band.
The order of the band statistics must be the same as in the OFPMT_METER_CONFIG stats reply.
A.3.5.13 Meter Conguration Statistics
The OFPMT_METER_CONFIG stats request message provides conguration for one or more meter. The
request body consists of a meter_id eld, which can be set to OFPM_ALL to refer to all meters on the
switch.
/* Body of OFPMP_METER and OFPMP_METER_CONFIG requests. */
struct ofp_meter_multipart_request {
uint32_t meter_id; /* Meter instance, or OFPM_ALL. */
uint8_t pad[4]; /* Align to 64 bits. */
};
OFP_ASSERT(sizeof(struct ofp_meter_multipart_request) == 8);
The body of the reply consists of an array of the following structure:
/* Body of reply to OFPMP_METER_CONFIG request. Meter configuration. */
struct ofp_meter_config {
uint16_t length; /* Length of this entry. */
uint16_t flags; /* All OFPMC_* that apply. */
uint32_t meter_id; /* Meter instance. */
struct ofp_meter_band_header bands[0]; /* The bands length is
inferred from the length field. */
};
OFP_ASSERT(sizeof(struct ofp_meter_config) == 8);
The elds are the same elds used for conguring the meter (see A.3.4.4).
87 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
A.3.5.14 Meter Features Statistics
The OFPMT_METER_FEATURES stats request message provides the set of features of the metering subsystem.
The request body is empty, and the body of the reply consists of the following structure:
/* Body of reply to OFPMP_METER_FEATURES request. Meter features. */
struct ofp_meter_features {
uint32_t max_meter; /* Maximum number of meters. */
uint32_t band_types; /* Bitmaps of OFPMBT_* values supported. */
uint32_t capabilities; /* Bitmaps of "ofp_meter_flags". */
uint8_t max_bands; /* Maximum bands per meters */
uint8_t max_color; /* Maximum color value */
uint8_t pad[2];
};
OFP_ASSERT(sizeof(struct ofp_meter_features) == 16);
A.3.5.15 Experimenter Multipart
Experimenter-specic multipart messages are requested with the OFPMP_EXPERIMENTER multipart type.
The rst bytes of the request and reply bodies are the following structure:
/* Body for ofp_multipart_request/reply of type OFPMP_EXPERIMENTER. */
struct ofp_experimenter_multipart_header {
uint32_t experimenter; /* Experimenter ID which takes the same form
as in struct ofp_experimenter_header. */
uint32_t exp_type; /* Experimenter defined. */
/* Experimenter-defined arbitrary additional data. */
};
OFP_ASSERT(sizeof(struct ofp_experimenter_multipart_header) == 8);
The rest of the request and reply bodies are experimenter-dened.
The experimenter eld is the Experimenter ID, which takes the same form as in struct
ofp_experimenter (see A.5.4).
A.3.6 Queue Conguration Messages
Queue conguration takes place outside the OpenFlow protocol, either through a command line tool or
through an external dedicated conguration protocol.
The controller can query the switch for congured queues on a port using the following structure:
/* Query for port queue configuration. */
struct ofp_queue_get_config_request {
struct ofp_header header;
uint32_t port; /* Port to be queried. Should refer
to a valid physical port (i.e. < OFPP_MAX),
or OFPP_ANY to request all configured
queues.*/
uint8_t pad[4];
};
OFP_ASSERT(sizeof(struct ofp_queue_get_config_request) == 16);
88 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
The switch replies back with an ofp_queue_get_config_reply command, containing a list of congured
queues.
/* Queue configuration for a given port. */
struct ofp_queue_get_config_reply {
struct ofp_header header;
uint32_t port;
uint8_t pad[4];
struct ofp_packet_queue queues[0]; /* List of configured queues. */
};
OFP_ASSERT(sizeof(struct ofp_queue_get_config_reply) == 16);
A.3.7 Packet-Out Message
When the controller wishes to send a packet out through the datapath, it uses the OFPT_PACKET_OUT
message:
/* Send packet (controller -> datapath). */
struct ofp_packet_out {
struct ofp_header header;
uint32_t buffer_id; /* ID assigned by datapath (OFP_NO_BUFFER
if none). */
uint32_t in_port; /* Packet's input port or OFPP_CONTROLLER. */
uint16_t actions_len; /* Size of action array in bytes. */
uint8_t pad[6];
struct ofp_action_header actions[0]; /* Action list. */
/* uint8_t data[0]; */ /* Packet data. The length is inferred
from the length field in the header.
(Only meaningful if buffer_id == -1.) */
};
OFP_ASSERT(sizeof(struct ofp_packet_out) == 24);
The buffer_id is the same given in the ofp_packet_in message. If the buffer_id is OFP_NO_BUFFER,
then the packet data is included in the data array. OFP_NO_BUFFER is 0x.
The in_port eld is the ingress port that must be associated with the packet for OpenFlow processing.
It must be set to either a valid standard switch port or OFPP_CONTROLLER.
The action eld is an action list dening how the packet should be processed by the switch. It may include
packet modication, group processing and an output port. The action list of an OFPT_PACKET_OUT
message can also specify the OFPP_TABLE reserved port as an output action to process the packet through
the existing 
ow entries, starting at the rst 
ow table. If OFPP_TABLE is specied, the in_port eld is
used as the ingress port in the 
ow table lookup.
In some cases, packets sent to OFPP_TABLE may be forwarded back to the controller as the result of a 
ow
entry action or table miss. Detecting and taking action for such controller-to-switch loops is outside the
scope of this specication. In general, OpenFlow messages are not guaranteed to be processed in order,
therefore if a OFPT_PACKET_OUT message using OFPP_TABLE depends on a 
ow that was recently sent to
the switch (with a OFPT_FLOW_MOD message), a OFPT_BARRIER_REQUEST message may be required prior
to the OFPT_PACKET_OUT message to make sure the 
ow entry was committed to the 
ow table prior to
execution of OFPP_TABLE.
89 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
A.3.8 Barrier Message
When the controller wants to ensure message dependencies have been met or wants to receive notications
for completed operations, it may use an OFPT_BARRIER_REQUEST message. This message has no
body. Upon receipt, the switch must nish processing all previously-received messages, including sending
corresponding reply or error messages, before executing any messages beyond the Barrier Request.
When such processing is complete, the switch must send an OFPT_BARRIER_REPLY message with the xid
of the original request.
A.3.9 Role Request Message
When the controller wants to change its role, it uses the OFPT_ROLE_REQUEST message with the following
structure:
/* Role request and reply message. */
struct ofp_role_request {
struct ofp_header header; /* Type OFPT_ROLE_REQUEST/OFPT_ROLE_REPLY. */
uint32_t role; /* One of NX_ROLE_*. */
uint8_t pad[4]; /* Align to 64 bits. */
uint64_t generation_id; /* Master Election Generation Id */
};
OFP_ASSERT(sizeof(struct ofp_role_request) == 24);
The eld role is the new role that the controller wants to assume, and can have the following values:
/* Controller roles. */
enum ofp_controller_role {
OFPCR_ROLE_NOCHANGE = 0, /* Don't change current role. */
OFPCR_ROLE_EQUAL = 1, /* Default role, full access. */
OFPCR_ROLE_MASTER = 2, /* Full access, at most one master. */
OFPCR_ROLE_SLAVE = 3, /* Read-only access. */
};
If the role value is OFPCR_ROLE_MASTER, all other controllers which role was OFPCR_ROLE_MASTER are
changed to OFPCR_ROLE_SLAVE. If the role value is OFPCR_ROLE_NOCHANGE, the current role of the controller
is not changed ; this enable a controller to query its current role without changing it.
Upon receipt of a OFPT_ROLE_REQUEST message, the switch must return a OFPT_ROLE_REPLY message.
The structure of this message is exactly the same as the OFPT_ROLE_REQUEST message, and the eld
role is the current role of the controller.
Additionally, if the role value in the message is OFPCR_ROLE_MASTER or OFPCR_ROLE_SLAVE, the switch
must validate generation_id to check for stale messages. If the validation fails, the switch must
discard the role request and return an error message with type OFPET_ROLE_REQUEST_FAILED and code
OFPRRFC_STALE.
90 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
A.3.10 Set Asynchronous Conguration Message
The controller is able to set and query the asynchronous messages that it wants to receive (other than
error messages) on a given OpenFlow channel with the OFPT_SET_ASYNC and OFPT_GET_ASYNC_REQUEST
messages, respectively. The switch responds to a OFPT_GET_ASYNC_REQUEST message with an
OFPT_GET_ASYNC_REPLY message; it does not reply to a request to set the conguration.
There is no body for OFPT_GET_ASYNC_REQUEST beyond the OpenFlow header. The OFPT_SET_ASYNC
and OFPT_GET_ASYNC_REPLY messages have the following format:
/* Asynchronous message configuration. */
struct ofp_async_config {
struct ofp_header header; /* OFPT_GET_ASYNC_REPLY or OFPT_SET_ASYNC. */
uint32_t packet_in_mask[2]; /* Bitmasks of OFPR_* values. */
uint32_t port_status_mask[2]; /* Bitmasks of OFPPR_* values. */
uint32_t flow_removed_mask[2];/* Bitmasks of OFPRR_* values. */
};
OFP_ASSERT(sizeof(struct ofp_async_config) == 32);
struct ofp_async_config contains three 2-element arrays. Each array controls whether the controller
receives asynchronous messages with a specic enum ofp_type. Within each array, element 0 species
messages of interest when the controller has a OFPCR_ROLE_EQUAL or OFPCR_ROLE_MASTER role; element
1, when the controller has a OFPCR_ROLE_SLAVE role. Each array element is a bit-mask in which a
0-bit disables receiving a message sent with the reason code corresponding to the bit index and a
1-bit enables receiving it. For example, the bit with value 22 = 4 in port_status_mask[1] determines
whether the controller will receive OFPT_PORT_STATUS messages with reason OFPPR_MODIFY (value 2)
when the controller has role OFPCR_ROLE_SLAVE.
OFPT_SET_ASYNC sets whether a controller should receive a given asynchronous message that is generated
by the switch. Other OpenFlow features control whether a given message is generated; for example,
the OFPFF_SEND_FLOW_REM 
ag controls whether the switch generates OFPT_FLOW_REMOVED a message
when a 
ow entry is removed.
A switch conguration, for example using the OpenFlow Conguration Protocol, may set the initial
conguration of asynchronous messages when an OpenFlow connection is established. In the absence
of such switch conguration, the initial conguration shall be:
. In the \master" or \equal" role, enable all OFPT_PACKET_IN messages, except those with reason
OFPR_INVALID_TTL, and enable all OFPT_PORT_STATUS and OFPT_FLOW_REMOVED messages.
. In the \slave" role, enable all OFPT_PORT_STATUS messages and disable all OFPT_PACKET_IN and
OFPT_FLOW_REMOVED messages.
The conguration set with OFPT_SET_ASYNC is specic to a particular OpenFlow channel. It does not
aect any other OpenFlow channel, whether currently established or to be established in the future.
The conguration set with OFPT_SET_ASYNC does not lter or otherwise aect error messages.
91 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
A.4 Asynchronous Messages
A.4.1 Packet-In Message
When packets are received by the datapath and sent to the controller, they use the OFPT_PACKET_IN
message:
/* Packet received on port (datapath -> controller). */
struct ofp_packet_in {
struct ofp_header header;
uint32_t buffer_id; /* ID assigned by datapath. */
uint16_t total_len; /* Full length of frame. */
uint8_t reason; /* Reason packet is being sent (one of OFPR_*) */
uint8_t table_id; /* ID of the table that was looked up */
uint64_t cookie; /* Cookie of the flow entry that was looked up. */
struct ofp_match match; /* Packet metadata. Variable size. */
/* Followed by:
* - Exactly 2 all-zero padding bytes, then
* - An Ethernet frame whose length is inferred from header.length.
* The padding bytes preceding the Ethernet frame ensure that the IP
* header (if any) following the Ethernet header is 32-bit aligned.
*/
//uint8_t pad[2]; /* Align to 64 bit + 16 bit */
//uint8_t data[0]; /* Ethernet frame */
};
OFP_ASSERT(sizeof(struct ofp_packet_in) == 32);
The buffer_id is an opaque value used by the datapath to identify a buered packet. When a packet
is buered, some number of bytes from the message will be included in the data portion of the message.
If the packet is sent because of a \send to controller" action, then max_len bytes from the
ofp_action_output of the 
ow setup request are sent. If the packet is sent for other reasons, such
as an invalid TTL, then at least miss_send_len bytes from the OFPT_SET_CONFIG message are sent.
The default miss_send_len is 128 bytes. If the packet is not buered - either because of no available
buers, or because of explicitly requested via OFPCML_NO_BUFFER - the entire packet is included in the
data portion, and the buffer_id is OFP_NO_BUFFER.
Switches that implement buering are expected to expose, through documentation, both the amount
of available buering, and the length of time before buers may be reused. A switch must gracefully
handle the case where a buered packet_in message yields no response from the controller. A switch
should prevent a buer from being reused until it has been handled by the controller, or some amount
of time (indicated in documentation) has passed.
The data eld contains the packet itself, or a fraction of the packet if the packet is buered. The packet
header re
ect any changes applied to the packet in previous processing.
The reason eld can be any of these values:
/* Why is this packet being sent to the controller? */
enum ofp_packet_in_reason {
OFPR_NO_MATCH = 0, /* No matching flow (table-miss flow entry). */
OFPR_ACTION = 1, /* Action explicitly output to controller. */
OFPR_INVALID_TTL = 2, /* Packet has invalid TTL */
};
92 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
OFPR_INVALID_TTL indicates that a packets with an invalid IP TTL or MPLS TTL was rejected by
the OpenFlow pipeline and passed to the controller. Checking for invalid TTL does not need to
be done for every packet, but it must be done at a minimum every time a OFPAT_DEC_MPLS_TTL or
OFPAT_DEC_NW_TTL action is applied to a packet.
The cookie eld contains the cookie of the 
ow entry that caused the packet to be sent to the controller.
This eld must be set to -1 (0x) if a cookie cannot be associated with a particular 
ow. For
example, if the packet-in was generated in a group bucket or from the action set.
The match eld re
ect the packet's headers and context when the event that triggers the packet-in message
occurred and contains a set of OXM TLVs. This context includes any changes applied to the packet
in previous processing, including actions already executed, if any, but not any changes in the action set.
The OXM TLVs must include context elds, that is, elds whose values cannot be determined from
the packet data. The standard context elds are OFPXMT_OFB_IN_PORT, OFPXMT_OFB_IN_PHY_PORT,
OFPXMT_OFB_METADATA and OFPXMT_OFB_TUNNEL_ID. Fields whose values are all-bits-zero should be
omitted. Optionally, the OXM TLVs may also include packet header elds that were previously extracted
from the packet, including any modications of those in the course of the processing.
When a packet is received directly on a physical port and not processed by a logical port,
OFPXMT_OFB_IN_PORT and OFPXMT_OFB_IN_PHY_PORT have the same value, the OpenFlow port no
of this physical port. OFPXMT_OFB_IN_PHY_PORT should be omitted if it has the same value as
OFPXMT_OFB_IN_PORT.
When a packet is received on a logical port by way of a physical port, OFPXMT_OFB_IN_PORT is the logical
port's port no and OFPXMT_OFB_IN_PHY_PORT is the physical port's port no. For example, consider a
packet received on a tunnel interface dened over a link aggregation group (LAG) with two physical port
members. If the tunnel interface is the logical port bound to OpenFlow, then OFPXMT_OFB_IN_PORT is
the tunnel port no and OFPXMT_OFB_IN_PHY_PORT is the physical port no member of the LAG on which
the tunnel is congured.
The port referenced by the OFPXMT_OFB_IN_PORT TLV must be the port used for matching 
ow entries
(see 5.3) and must be available to OpenFlow processing (i.e. OpenFlow can forward packet to this port,
depending on port 
ags). OFPXMT_OFB_IN_PHY_PORT need not be available for matching or OpenFlow
processing.
A.4.2 Flow Removed Message
If the controller has requested to be notied when 
ow entries time out or are deleted from tables, the
datapath does this with the OFPT_FLOW_REMOVED message:
/* Flow removed (datapath -> controller). */
struct ofp_flow_removed {
struct ofp_header header;
uint64_t cookie; /* Opaque controller-issued identifier. */
uint16_t priority; /* Priority level of flow entry. */
uint8_t reason; /* One of OFPRR_*. */
uint8_t table_id; /* ID of the table */
uint32_t duration_sec; /* Time flow was alive in seconds. */
93 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
uint32_t duration_nsec; /* Time flow was alive in nanoseconds beyond
duration_sec. */
uint16_t idle_timeout; /* Idle timeout from original flow mod. */
uint16_t hard_timeout; /* Hard timeout from original flow mod. */
uint64_t packet_count;
uint64_t byte_count;
struct ofp_match match; /* Description of fields. Variable size. */
};
OFP_ASSERT(sizeof(struct ofp_flow_removed) == 56);
The match, cookie, and priority elds are the same as those used in the 
ow mod request.
The reason eld is one of the following:
/* Why was this flow removed? */
enum ofp_flow_removed_reason {
OFPRR_IDLE_TIMEOUT = 0, /* Flow idle time exceeded idle_timeout. */
OFPRR_HARD_TIMEOUT = 1, /* Time exceeded hard_timeout. */
OFPRR_DELETE = 2, /* Evicted by a DELETE flow mod. */
OFPRR_GROUP_DELETE = 3, /* Group was removed. */
};
The duration_sec and duration_nsec elds are described in Section A.3.5.2.
The idle_timeout and hard_timeout elds are directly copied from the 
ow mod that created this
entry.
With the above three elds, one can nd both the amount of time the 
ow entry was active, as well as
the amount of time the 
ow entry received trac.
The packet_count and byte_count indicate the number of packets and bytes that were associated with
this 
ow entry, respectively. Those counters should behave like other statistics counters (see A.3.5) ;
they are unsigned and should be set to the maximum eld value if not available.
A.4.3 Port Status Message
As ports are added, modied, and removed from the datapath, the controller needs to be informed with
the OFPT_PORT_STATUS message:
/* A physical port has changed in the datapath */
struct ofp_port_status {
struct ofp_header header;
uint8_t reason; /* One of OFPPR_*. */
uint8_t pad[7]; /* Align to 64-bits. */
struct ofp_port desc;
};
OFP_ASSERT(sizeof(struct ofp_port_status) == 80);
The reason can be one of the following values:
94 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
/* What changed about the physical port */
enum ofp_port_reason {
OFPPR_ADD = 0, /* The port was added. */
OFPPR_DELETE = 1, /* The port was removed. */
OFPPR_MODIFY = 2, /* Some attribute of the port has changed. */
};
A.4.4 Error Message
There are times that the switch needs to notify the controller of a problem. This is done with the
OFPT_ERROR_MSG message:
/* OFPT_ERROR: Error message (datapath -> controller). */
struct ofp_error_msg {
struct ofp_header header;
uint16_t type;
uint16_t code;
uint8_t data[0]; /* Variable-length data. Interpreted based
on the type and code. No padding. */
};
OFP_ASSERT(sizeof(struct ofp_error_msg) == 12);
The type value indicates the high-level type of error. The code value is interpreted based on the type.
The data is variable length and interpreted based on the type and code. Unless specied otherwise, the
data eld contains at least 64 bytes of the failed request that caused the error message to be generated,
if the failed request is shorter than 64 bytes it should be the full request without any padding.
If the error message is in response to a specic message from the controller, e.g., OFPET_BAD_REQUEST,
OFPET_BAD_ACTION, OFPET_BAD_INSTRUCTION, OFPET_BAD_MATCH, or OFPET_FLOW_MOD_FAILED, then
the xid eld of the header must match that of the oending message.
Error codes ending in _EPERM correspond to a permissions error generated by, for example, an OpenFlow
hypervisor interposing between a controller and switch.
Currently dened error types are:
/* Values for 'type' in ofp_error_message. These values are immutable: they
* will not change in future versions of the protocol (although new values may
* be added). */
enum ofp_error_type {
OFPET_HELLO_FAILED = 0, /* Hello protocol failed. */
OFPET_BAD_REQUEST = 1, /* Request was not understood. */
OFPET_BAD_ACTION = 2, /* Error in action description. */
OFPET_BAD_INSTRUCTION = 3, /* Error in instruction list. */
OFPET_BAD_MATCH = 4, /* Error in match. */
OFPET_FLOW_MOD_FAILED = 5, /* Problem modifying flow entry. */
OFPET_GROUP_MOD_FAILED = 6, /* Problem modifying group entry. */
OFPET_PORT_MOD_FAILED = 7, /* Port mod request failed. */
OFPET_TABLE_MOD_FAILED = 8, /* Table mod request failed. */
OFPET_QUEUE_OP_FAILED = 9, /* Queue operation failed. */
OFPET_SWITCH_CONFIG_FAILED = 10, /* Switch config request failed. */
95 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
OFPET_ROLE_REQUEST_FAILED = 11, /* Controller Role request failed. */
OFPET_METER_MOD_FAILED = 12, /* Error in meter. */
OFPET_TABLE_FEATURES_FAILED = 13, /* Setting table features failed. */
OFPET_EXPERIMENTER = 0xffff /* Experimenter error messages. */
};
For the OFPET_HELLO_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_HELLO_FAILED. 'data' contains an
* ASCII text string that may give failure details. */
enum ofp_hello_failed_code {
OFPHFC_INCOMPATIBLE = 0, /* No compatible version. */
OFPHFC_EPERM = 1, /* Permissions error. */
};
The data eld contains an ASCII text string that adds detail on why the error occurred.
For the OFPET_BAD_REQUEST error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_BAD_REQUEST. 'data' contains at least
* the first 64 bytes of the failed request. */
enum ofp_bad_request_code {
OFPBRC_BAD_VERSION = 0, /* ofp_header.version not supported. */
OFPBRC_BAD_TYPE = 1, /* ofp_header.type not supported. */
OFPBRC_BAD_MULTIPART = 2, /* ofp_multipart_request.type not supported. */
OFPBRC_BAD_EXPERIMENTER = 3, /* Experimenter id not supported
* (in ofp_experimenter_header or
* ofp_multipart_request or
* ofp_multipart_reply). */
OFPBRC_BAD_EXP_TYPE = 4, /* Experimenter type not supported. */
OFPBRC_EPERM = 5, /* Permissions error. */
OFPBRC_BAD_LEN = 6, /* Wrong request length for type. */
OFPBRC_BUFFER_EMPTY = 7, /* Specified buffer has already been used. */
OFPBRC_BUFFER_UNKNOWN = 8, /* Specified buffer does not exist. */
OFPBRC_BAD_TABLE_ID = 9, /* Specified table-id invalid or does not
* exist. */
OFPBRC_IS_SLAVE = 10, /* Denied because controller is slave. */
OFPBRC_BAD_PORT = 11, /* Invalid port. */
OFPBRC_BAD_PACKET = 12, /* Invalid packet in packet-out. */
OFPBRC_MULTIPART_BUFFER_OVERFLOW = 13, /* ofp_multipart_request
overflowed the assigned buffer. */
};
For the OFPET_BAD_ACTION error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_BAD_ACTION. 'data' contains at least
* the first 64 bytes of the failed request. */
enum ofp_bad_action_code {
OFPBAC_BAD_TYPE = 0, /* Unknown action type. */
OFPBAC_BAD_LEN = 1, /* Length problem in actions. */
OFPBAC_BAD_EXPERIMENTER = 2, /* Unknown experimenter id specified. */
OFPBAC_BAD_EXP_TYPE = 3, /* Unknown action for experimenter id. */
OFPBAC_BAD_OUT_PORT = 4, /* Problem validating output port. */
96 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
OFPBAC_BAD_ARGUMENT = 5, /* Bad action argument. */
OFPBAC_EPERM = 6, /* Permissions error. */
OFPBAC_TOO_MANY = 7, /* Can't handle this many actions. */
OFPBAC_BAD_QUEUE = 8, /* Problem validating output queue. */
OFPBAC_BAD_OUT_GROUP = 9, /* Invalid group id in forward action. */
OFPBAC_MATCH_INCONSISTENT = 10, /* Action can't apply for this match,
or Set-Field missing prerequisite. */
OFPBAC_UNSUPPORTED_ORDER = 11, /* Action order is unsupported for the
action list in an Apply-Actions instruction */
OFPBAC_BAD_TAG = 12, /* Actions uses an unsupported
tag/encap. */
OFPBAC_BAD_SET_TYPE = 13, /* Unsupported type in SET_FIELD action. */
OFPBAC_BAD_SET_LEN = 14, /* Length problem in SET_FIELD action. */
OFPBAC_BAD_SET_ARGUMENT = 15, /* Bad argument in SET_FIELD action. */
};
For the OFPET_BAD_INSTRUCTION error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_BAD_INSTRUCTION. 'data' contains at least
* the first 64 bytes of the failed request. */
enum ofp_bad_instruction_code {
OFPBIC_UNKNOWN_INST = 0, /* Unknown instruction. */
OFPBIC_UNSUP_INST = 1, /* Switch or table does not support the
instruction. */
OFPBIC_BAD_TABLE_ID = 2, /* Invalid Table-ID specified. */
OFPBIC_UNSUP_METADATA = 3, /* Metadata value unsupported by datapath. */
OFPBIC_UNSUP_METADATA_MASK = 4, /* Metadata mask value unsupported by
datapath. */
OFPBIC_BAD_EXPERIMENTER = 5, /* Unknown experimenter id specified. */
OFPBIC_BAD_EXP_TYPE = 6, /* Unknown instruction for experimenter id. */
OFPBIC_BAD_LEN = 7, /* Length problem in instructions. */
OFPBIC_EPERM = 8, /* Permissions error. */
};
For the OFPET_BAD_MATCH error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_BAD_MATCH. 'data' contains at least
* the first 64 bytes of the failed request. */
enum ofp_bad_match_code {
OFPBMC_BAD_TYPE = 0, /* Unsupported match type specified by the
match */
OFPBMC_BAD_LEN = 1, /* Length problem in match. */
OFPBMC_BAD_TAG = 2, /* Match uses an unsupported tag/encap. */
OFPBMC_BAD_DL_ADDR_MASK = 3, /* Unsupported datalink addr mask - switch
does not support arbitrary datalink
address mask. */
OFPBMC_BAD_NW_ADDR_MASK = 4, /* Unsupported network addr mask - switch
does not support arbitrary network
address mask. */
OFPBMC_BAD_WILDCARDS = 5, /* Unsupported combination of fields masked
or omitted in the match. */
OFPBMC_BAD_FIELD = 6, /* Unsupported field type in the match. */
OFPBMC_BAD_VALUE = 7, /* Unsupported value in a match field. */
OFPBMC_BAD_MASK = 8, /* Unsupported mask specified in the match,
97 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
field is not dl-address or nw-address. */
OFPBMC_BAD_PREREQ = 9, /* A prerequisite was not met. */
OFPBMC_DUP_FIELD = 10, /* A field type was duplicated. */
OFPBMC_EPERM = 11, /* Permissions error. */
};
For the OFPET_FLOW_MOD_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_FLOW_MOD_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_flow_mod_failed_code {
OFPFMFC_UNKNOWN = 0, /* Unspecified error. */
OFPFMFC_TABLE_FULL = 1, /* Flow not added because table was full. */
OFPFMFC_BAD_TABLE_ID = 2, /* Table does not exist */
OFPFMFC_OVERLAP = 3, /* Attempted to add overlapping flow with
CHECK_OVERLAP flag set. */
OFPFMFC_EPERM = 4, /* Permissions error. */
OFPFMFC_BAD_TIMEOUT = 5, /* Flow not added because of unsupported
idle/hard timeout. */
OFPFMFC_BAD_COMMAND = 6, /* Unsupported or unknown command. */
OFPFMFC_BAD_FLAGS = 7, /* Unsupported or unknown flags. */
};
For the OFPET_GROUP_MOD_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_GROUP_MOD_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_group_mod_failed_code {
OFPGMFC_GROUP_EXISTS = 0, /* Group not added because a group ADD
attempted to replace an
already-present group. */
OFPGMFC_INVALID_GROUP = 1, /* Group not added because Group
specified is invalid. */
OFPGMFC_WEIGHT_UNSUPPORTED = 2, /* Switch does not support unequal load
sharing with select groups. */
OFPGMFC_OUT_OF_GROUPS = 3, /* The group table is full. */
OFPGMFC_OUT_OF_BUCKETS = 4, /* The maximum number of action buckets
for a group has been exceeded. */
OFPGMFC_CHAINING_UNSUPPORTED = 5, /* Switch does not support groups that
forward to groups. */
OFPGMFC_WATCH_UNSUPPORTED = 6, /* This group cannot watch the watch_port
or watch_group specified. */
OFPGMFC_LOOP = 7, /* Group entry would cause a loop. */
OFPGMFC_UNKNOWN_GROUP = 8, /* Group not modified because a group
MODIFY attempted to modify a
non-existent group. */
OFPGMFC_CHAINED_GROUP = 9, /* Group not deleted because another
group is forwarding to it. */
OFPGMFC_BAD_TYPE = 10, /* Unsupported or unknown group type. */
OFPGMFC_BAD_COMMAND = 11, /* Unsupported or unknown command. */
OFPGMFC_BAD_BUCKET = 12, /* Error in bucket. */
OFPGMFC_BAD_WATCH = 13, /* Error in watch port/group. */
OFPGMFC_EPERM = 14, /* Permissions error. */
};
98 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
For the OFPET_PORT_MOD_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_PORT_MOD_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_port_mod_failed_code {
OFPPMFC_BAD_PORT = 0, /* Specified port number does not exist. */
OFPPMFC_BAD_HW_ADDR = 1, /* Specified hardware address does not
* match the port number. */
OFPPMFC_BAD_CONFIG = 2, /* Specified config is invalid. */
OFPPMFC_BAD_ADVERTISE = 3, /* Specified advertise is invalid. */
OFPPMFC_EPERM = 4, /* Permissions error. */
};
For the OFPET_TABLE_MOD_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_TABLE_MOD_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_table_mod_failed_code {
OFPTMFC_BAD_TABLE = 0, /* Specified table does not exist. */
OFPTMFC_BAD_CONFIG = 1, /* Specified config is invalid. */
OFPTMFC_EPERM = 2, /* Permissions error. */
};
For the OFPET_QUEUE_OP_FAILED error type, the following codes are currently dened:
/* ofp_error msg 'code' values for OFPET_QUEUE_OP_FAILED. 'data' contains
* at least the first 64 bytes of the failed request */
enum ofp_queue_op_failed_code {
OFPQOFC_BAD_PORT = 0, /* Invalid port (or port does not exist). */
OFPQOFC_BAD_QUEUE = 1, /* Queue does not exist. */
OFPQOFC_EPERM = 2, /* Permissions error. */
};
For the OFPET_SWITCH_CONFIG_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_SWITCH_CONFIG_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_switch_config_failed_code {
OFPSCFC_BAD_FLAGS = 0, /* Specified flags is invalid. */
OFPSCFC_BAD_LEN = 1, /* Specified len is invalid. */
OFPSCFC_EPERM = 2, /* Permissions error. */
};
For the OFPET_ROLE_REQUEST_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_ROLE_REQUEST_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_role_request_failed_code {
OFPRRFC_STALE = 0, /* Stale Message: old generation_id. */
OFPRRFC_UNSUP = 1, /* Controller role change unsupported. */
OFPRRFC_BAD_ROLE = 2, /* Invalid role. */
};
99 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
For the OFPET_METER_MOD_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_METER_MOD_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_meter_mod_failed_code {
OFPMMFC_UNKNOWN = 0, /* Unspecified error. */
OFPMMFC_METER_EXISTS = 1, /* Meter not added because a Meter ADD
* attempted to replace an existing Meter. */
OFPMMFC_INVALID_METER = 2, /* Meter not added because Meter specified
* is invalid. */
OFPMMFC_UNKNOWN_METER = 3, /* Meter not modified because a Meter
MODIFY attempted to modify a non-existent
Meter. */
OFPMMFC_BAD_COMMAND = 4, /* Unsupported or unknown command. */
OFPMMFC_BAD_FLAGS = 5, /* Flag configuration unsupported. */
OFPMMFC_BAD_RATE = 6, /* Rate unsupported. */
OFPMMFC_BAD_BURST = 7, /* Burst size unsupported. */
OFPMMFC_BAD_BAND = 8, /* Band unsupported. */
OFPMMFC_BAD_BAND_VALUE = 9, /* Band value unsupported. */
OFPMMFC_OUT_OF_METERS = 10, /* No more meters available. */
OFPMMFC_OUT_OF_BANDS = 11, /* The maximum number of properties
* for a meter has been exceeded. */
};
For the OFPET_TABLE_FEATURES_FAILED error type, the following codes are currently dened:
/* ofp_error_msg 'code' values for OFPET_TABLE_FEATURES_FAILED. 'data' contains
* at least the first 64 bytes of the failed request. */
enum ofp_table_features_failed_code {
OFPTFFC_BAD_TABLE = 0, /* Specified table does not exist. */
OFPTFFC_BAD_METADATA = 1, /* Invalid metadata mask. */
OFPTFFC_BAD_TYPE = 2, /* Unknown property type. */
OFPTFFC_BAD_LEN = 3, /* Length problem in properties. */
OFPTFFC_BAD_ARGUMENT = 4, /* Unsupported property value. */
OFPTFFC_EPERM = 5, /* Permissions error. */
};
For the OFPET_EXPERIMENTER error type, the error message is dened by the following structure and
elds, followed by experimenter dened data:
/* OFPET_EXPERIMENTER: Error message (datapath -> controller). */
struct ofp_error_experimenter_msg {
struct ofp_header header;
uint16_t type; /* OFPET_EXPERIMENTER. */
uint16_t exp_type; /* Experimenter defined. */
uint32_t experimenter; /* Experimenter ID which takes the same form
as in struct ofp_experimenter_header. */
uint8_t data[0]; /* Variable-length data. Interpreted based
on the type and code. No padding. */
};
OFP_ASSERT(sizeof(struct ofp_error_experimenter_msg) == 16);
The experimenter eld is the Experimenter ID, which takes the same form as in struct
ofp_experimenter (see A.5.4).
100 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
A.5 Symmetric Messages
A.5.1 Hello
The OFPT_HELLO message consists of an OpenFlow header plus a set of variable size hello elements.
/* OFPT_HELLO. This message includes zero or more hello elements having
* variable size. Unknown elements types must be ignored/skipped, to allow
* for future extensions. */
struct ofp_hello {
struct ofp_header header;
/* Hello element list */
struct ofp_hello_elem_header elements[0];
};
OFP_ASSERT(sizeof(struct ofp_hello) == 8);
The version eld part of the header eld (see A.1) must be set to the highest OpenFlow protocol
version supported by the sender (see 6.3.1).
The elements eld is a set of hello elements, containing optional data to inform the initial handshake
of the connection. Implementations must ignore (skip) all elements of a Hello message that they do not
support. The list of hello elements types that are currently dened are:
/* Hello elements types.
*/
enum ofp_hello_elem_type {
OFPHET_VERSIONBITMAP = 1, /* Bitmap of version supported. */
};
An element denition contains the element type, length, and any associated data:
/* Common header for all Hello Elements */
struct ofp_hello_elem_header {
uint16_t type; /* One of OFPHET_*. */
uint16_t length; /* Length in bytes of this element. */
};
OFP_ASSERT(sizeof(struct ofp_hello_elem_header) == 4);
The OFPHET_VERSIONBITMAP element use the following structure and elds:
/* Version bitmap Hello Element */
struct ofp_hello_elem_versionbitmap {
uint16_t type; /* OFPHET_VERSIONBITMAP. */
uint16_t length; /* Length in bytes of this element. */
/* Followed by:
* - Exactly (length - 4) bytes containing the bitmaps, then
* - Exactly (length + 7)/8*8 - (length) (between 0 and 7)
* bytes of all-zero bytes */
uint32_t bitmaps[0]; /* List of bitmaps - supported versions */
};
OFP_ASSERT(sizeof(struct ofp_hello_elem_versionbitmap) == 4);
101 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
The bitmaps eld indicates the set of versions of the OpenFlow switch protocol a device supports,
and may be used during version negotiation (see 6.3.1). The bits of the set of bitmaps are indexed
by the ofp version number of the protocol ; if the bit identied by the number of left bitshift equal
to a ofp version number is set, this OpenFlow version is supported. The number of bitmaps included
in the eld depend on the highest version number supported : ofp versions 0 to 31 are encoded in
the rst bitmap, ofp versions 32 to 63 are encoded in the second bitmap and so on. For example, if
a switch supports only version 1.0 (ofp version=0x01) and version 1.3 (ofp version=0x04), the rst
bitmap would be set to 0x00000012.
A.5.2 Echo Request
An Echo Request message consists of an OpenFlow header plus an arbitrary-length data eld. The
data eld might be a message timestamp to check latency, various lengths to measure bandwidth, or
zero-size to verify liveness between the switch and controller.
A.5.3 Echo Reply
An Echo Reply message consists of an OpenFlow header plus the unmodied data eld of an echo
request message.
In an OpenFlow protocol implementation divided into multiple layers, the echo request/reply logic
should be implemented in the "deepest" practical layer. For example, in the OpenFlow reference
implementation that includes a userspace process that relays to a kernel module, echo request/reply is
implemented in the kernel module. Receiving a correctly formatted echo reply then shows a greater
likelihood of correct end-to-end functionality than if the echo request/reply were implemented in the
userspace process, as well as providing more accurate end-to-end latency timing.
A.5.4 Experimenter
The Experimenter message is dened as follows:
/* Experimenter extension. */
struct ofp_experimenter_header {
struct ofp_header header; /* Type OFPT_EXPERIMENTER. */
uint32_t experimenter; /* Experimenter ID:
* - MSB 0: low-order bytes are IEEE OUI.
* - MSB != 0: defined by ONF. */
uint32_t exp_type; /* Experimenter defined. */
/* Experimenter-defined arbitrary additional data. */
};
OFP_ASSERT(sizeof(struct ofp_experimenter_header) == 16);
The experimenter eld is a 32-bit value that uniquely identies the experimenter. If the most signicant
byte is zero, the next three bytes are the experimenter's IEEE OUI. If the most signicant byte is not
zero, it is a value allocated by the Open Networking Foundation. If experimenter does not have (or wish
to use) their OUI, they should contact the Open Networking Foundation to obtain a unique experimenter
ID.
102 . 2012; The Open Networking Foundation
OpenFlow Switch Specication Version 1.3.1
The rest of the body is uninterpreted by standard OpenFlow processing and is arbitrarily dened by
the corresponding experimenter.
If a switch does not understand a experimenter extension, it must send an OFPT_ERROR message with a
OFPBRC_BAD_EXPERIMENTER error code and OFPET_BAD_REQUEST error type.
Appendix B Release Notes
This section contains release notes highlighting the main changes between the main versions of the
